number = 0
for x in range(1,101):
    print(x)
    number += x
print (number)

"""
Задача 3
Найти сумму ряда чисел от 1 до 100. Полученный результат вывести на экран.
"""