number = 1
for x in range(1, 11):
    number = number * x
print(number)

"""
Задача 4
Найти произведение ряда чисел от 1 до 10. Полученный результат вывести на экран.
"""
